#include "mainwindow.h"

#include <QApplication>
//#include <QFileDialog>
#include <QLineEdit>
#include <QLabel>

// После запуска настраивается пользователем:
// а) маска входных файлов, например .txt, testFile.bin----------------------------------------------------------------\/
// b) настройка необходимости удалять входные файлы или нет------------------------------------------------------------\/
// c) путь для сохранения результирующих файлов------------------------------------------------------------------------\/
// d) действия при повторении имени выходного файла: перезапись или----------------------------------------------------\/
// модификация, например, счетчик к имени файла      //через нижнее подчеркивание--------------------------------------\/
// e) работа по таймеру или разовый запуск-----------------------------------------------------------------------------\/
// f) периодичность опроса наличия входного файла (таймер)-------------------------------------------------------------\/
// g) значение 8 байт для бинарной операции модификации файла----------------------------------------------------------\/
// Функциональность: модифицирует входные файлы, операция XOR с 8-байтной переменной, введенной с формы (Пункт 1,g)----\/

// Обработка должна позволять обработать большого объёма файлы без "замирания" основной программы!---------------------\/
// Плюсом будет статус выполнения и прогресс выполнения обработки!-----------------------------------------------------

// Среда разработки QT Creator, язык программирования С++, операционная система Windows, компилятор MinGW.-------------\/
// Результат работы должен содержать .pro или CMakeLists.txt файл обязательно.-----------------------------------------\/


int main(int argc, char *argv[])
{
    QApplication a(argc, argv);
    MainWindow w;
    w.show();
    return a.exec();
}
